<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"58b57e063113f65580cda715e731a3f84c8547636bfe27fae6b2a1306df522e2","plan_job_ref":"Job Plan Airflow DAGs #238 at https://github.com/cal-itp/data-infra/actions/runs/16208598291","plan_out_hash":"27379a8f6adfdc0784cf982c558dfe1f3d80fd7bd743668bf60f6b8fe78f5077","plan_hash":"d32dae5d19fcefc0faac9b2bc761f0cc92c3f2770073514355d5dc1d9fb75ba2","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-partial_parse" {
!~      content             = (sensitive value)
!~      crc32c              = "OzNfuQ==" -> (known after apply)
!~      detect_md5hash      = "gQDYRjFTdm3tOMNXeu84Og==" -> "different hash"
!~      generation          = 1752010341206630 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/partial_parse.msgpack"
!~      md5hash             = "gQDYRjFTdm3tOMNXeu84Og==" -> (known after apply)
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #238](https://github.com/cal-itp/data-infra/actions/runs/16208598291)